chjgsnt/STM32-LiDAR-AMR/AMR_LiDAR_Robot/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define B1_Pin GPIO_PIN_13
#define B1_GPIO_Port GPIOC
#define USART_TX_Pin GPIO_PIN_2
#define USART_TX_GPIO_Port GPIOA
#define USART_RX_Pin GPIO_PIN_3
#define USART_RX_GPIO_Port GPIOA
#define LD2_Pin GPIO_PIN_5
#define LD2_GPIO_Port GPIOA
#define TMS_Pin GPIO_PIN_13
#define TMS_GPIO_Port GPIOA
#define TCK_Pin GPIO_PIN_14
#define TCK_GPIO_Port GPIOA
#define SWO_Pin GPIO_PIN_3
#define SWO_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */
#ifndef APP_ENABLE_MOTOR_TEST
#define APP_ENABLE_MOTOR_TEST 0
#endif

#ifndef APP_ENABLE_MOTOR_GPIO_STATIC_TEST
#define APP_ENABLE_MOTOR_GPIO_STATIC_TEST 0
#endif

#ifndef APP_ENABLE_CHASSIS_OPENLOOP_TEST
#define APP_ENABLE_CHASSIS_OPENLOOP_TEST 0
#endif

#ifndef APP_ENABLE_CHASSIS_DIRECTION_CAL_TEST
#define APP_ENABLE_CHASSIS_DIRECTION_CAL_TEST 0
#endif

#ifndef APP_ENABLE_CHASSIS_GROUND_TRACTION_TEST
#define APP_ENABLE_CHASSIS_GROUND_TRACTION_TEST 0
#endif

#ifndef APP_ENABLE_CHASSIS_SPEED_BALANCE_TEST
#define APP_ENABLE_CHASSIS_SPEED_BALANCE_TEST 1
#endif

#ifndef APP_ENABLE_I2C_BUS_RECOVERY
#define APP_ENABLE_I2C_BUS_RECOVERY 1
#endif

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
